emacs/.emacs.d/emacs.org

* System Setup
#+PROPERTY: header-args:emacs-lisp :tangle ~/.dotfiles/emacs/.emacs.d/init.el :mkdirp yes


#+begin_src emacs-lisp

  ;; package -- Summary


  ;;; Commentary:

  ;; NOTE: init.el is now generated from Emacs.org.  Please edit that file
  ;;       in Emacs and init.el will be generated automatically!

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun efs/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'efs/display-startup-time)

  ;; You will most likely need to adjust this font size for your system!
  ;; (defvar efs/default-font-size 120)
  ;; (defvar efs/default-variable-font-size 120)

#+end_src

* Package System Setup

#+begin_src emacs-lisp

  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

* Basic UI 

#+begin_src emacs-lisp

      (setq inhibit-startup-message t)

      (set-frame-parameter (selected-frame) 'alpha '(95 . 95))
      (add-to-list 'default-frame-alist '(alpha . (95 . 95)))
      (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
      (add-to-list 'default-frame-alist '(fullscreen . maximized))

       (scroll-bar-mode -1)        ; Disable visible scrollbar
       (tool-bar-mode -1)          ; Disable the toolbar
       (tooltip-mode -1)           ; Disable tooltips
       (set-fringe-mode 10)        ; Give some breathing room
       (menu-bar-mode -1)            ; Disable the menu bar

       (setq visible-bell t)
       (setq initial-scratch-message "")	        ; Make *scratch* buffer blank
       (setq use-short-answers t)                   ; y-or-n-p makes answering questions faster
       (global-hl-line-mode 1)			; Highlight the current line 
       (setq read-process-output-max (* 1024 1024))  ; Increase the amount of data which Emacs reads

       ;; turn off auto revert messages
       (setq auto-revert-verbose nil)

       (column-number-mode)
       (global-display-line-numbers-mode t)
       (setq display-line-numbers-type 'relative)

       ;; Disable line numbers for some modes
       (dolist (mode '(org-mode-hook
                       term-mode-hook
                       treemacs-mode-hook
                       shell-mode-hook
                       vterm-mode-hook
                       eshell-mode-hook
                       info-mode-hook))
            (add-hook mode (lambda () (display-line-numbers-mode 0))))

      ;; Dont popup UI dialogs when prompting
      ;; (setq use-dialog-box nil)

      ;; Move customization variables to a separate file and load it
      (setq custom-file (locate-user-emacs-file "custom-vars.el"))
      (load custom-file 'noerror 'nomessage)

      ;; Remember and restore the last cursor location of opened files
      (save-place-mode 1)

      ;; Save what you enter into minibuffer prompts
      (setq history-length 25)
      (savehist-mode 1)

      (all-the-icons-completion-mode)
      (add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup)

      (setq read-extended-command-predicate nil)
      (setq completions-detailed nil)
      ;; Always split new windows horizontally
      ;;  (setq split-width-threshold nil)
      ;;  (setq split-height-threshold 0)


#+end_src

** System Options

#+begin_src emacs-lisp

    ;; Revert buffers when underlying file has changed
    (global-auto-revert-mode 1)

    ;; Revert Dired and other buffers
    (setq global-auto-revert-non-file-buffers t)

    ;; Remember recently edited files using M-x recentf-open-files
    (recentf-mode 1)

    (use-package super-save
     :ensure t
     :config
     (super-save-mode +1))     
     (setq super-save-auto-save-when-idle nil)
     ;;(setq auto-save-default nil)

    (defun bjm/kill-this-buffer ()
      "Kill the current buffer."
      (interactive)
      (kill-buffer (current-buffer)))

    (global-set-key (kbd "C-x k") 'bjm/kill-this-buffer)
  
#+end_src

** Undo 

#+begin_src emacs-lisp

  (use-package undo-tree) 
  (global-undo-tree-mode)

  ;;(use-package undo-fu)


#+end_src

** Clipboard

#+begin_src emacs-lisp

  ;; Save whatever’s in the current (system) clipboard before
  ;; replacing it with the Emacs’ text.
  ;; https://github.com/dakrone/eos/blob/master/eos.org
  (setq save-interprogram-paste-before-kill t)

#+end_src

** Tab Configuration

#+begin_src emacs-lisp

  
  (setq-default tab-width 2)
  (setq-default evil-shift-width tab-width)

  ;;Use spaces instead of tabs for indentation
  (setq-default indent-tabs-mode nil)


    ;; ;; Create a variable for our preferred tab width
    ;; (setq custom-tab-width 4)

    ;; ;; Two callable functions for enabling/disabling tabs in Emacs
    ;; (defun disable-tabs () (setq indent-tabs-mode nil))
    ;; (defun enable-tabs  ()
    ;;   (local-set-key (kbd "TAB") 'tab-to-tab-stop)
    ;;   (setq indent-tabs-mode t)
    ;;   (setq tab-width custom-tab-width))

    ;; ;; Hooks to Enable Tabs
    ;; (add-hook 'prog-mode-hook 'enable-tabs)
    ;; ;; Hooks to Disable Tabs
    ;; (add-hook 'lisp-mode-hook 'disable-tabs)
    ;; (add-hook 'emacs-lisp-mode-hook 'disable-tabs)

    ;; ;; Language-Specific Tweaks
    ;; (setq-default python-indent-offset custom-tab-width) ;; Python
    ;; (setq-default js-indent-level custom-tab-width)      ;; Javascript

    ;; ;; Making electric-indent behave sanely
    ;; (setq-default electric-indent-inhibit t)

    ;; ;; Make the backspace properly erase the tab instead of
    ;; ;; removing 1 space at a time.
    ;; (setq backward-delete-char-untabify-method 'hungry)

#+end_src

** Font Configuration

#+begin_src emacs-lisp

  (set-face-attribute 'default nil :font "JetBrains Mono" :height 130)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "JetBrains Mono" :height 130) 

  ;; Set the variable pitch face
  ;;(set-face-attribute 'variable-pitch nil :font "Arimo Nerd Font" :height 160 :weight 'regular)
  (set-face-attribute 'variable-pitch nil :font "ETBembo" :height 180 :weight 'regular)


#+end_src

* Keybinding 

#+begin_src emacs-lisp


  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package general
    :config
    (general-create-definer my/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (my/leader-keys
      "o"  '(:ignore o :which-key "Org Mode")
      "oc" '(org-capture :which-key "capture")
      "oa" '(org-agenda :which-key "Agenda") 

      "t"  '(:ignore t :which-key "toggles")
      "tt" '(counsel-load-theme :which-key "choose theme")))

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-undo-system 'undo-tree)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

* UI Configuration
** Color Theme

#+begin_src emacs-lisp
  

  (use-package doom-themes
    :init (load-theme 'doom-gruvbox 1))


#+end_src

** Ace Window
#+begin_src emacs-lisp

  (global-set-key (kbd "M-o") 'ace-window)
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (setq aw-dispatch-always t)


#+end_src

** Indent Highlighting
#+begin_src emacs-lisp

  (use-package highlight-indent-guides
      :config
      (setq highlight-indent-guides-delay '0)
     (setq highlight-indent-guides-responsive 'top)
      (setq highlight-indent-guides-method 'character))

  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)     

#+end_src

