emacs/.emacs.d/init.el
(global-org-modern-mode)

;; Must do this so the agenda knows where to look for my files
(setq org-agenda-files '("~/PIM"))

;; When a TODO is set to a done state, record a timestamp
(setq org-log-done 'time)

;; Follow the links
(setq org-return-follows-link  t)

;; Associate all org files with org mode
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))

;; Make the indentation look nicer
(add-hook 'org-mode-hook 'org-indent-mode)

;; Remap the change priority keys to use the UP or DOWN key
(define-key org-mode-map (kbd "C-c <up>") 'org-priority-up)
(define-key org-mode-map (kbd "C-c <down>") 'org-priority-down)

;; Shortcuts for storing links, viewing the agenda, and starting a capture
;; (define-key global-map "\C-cl" 'org-store-link)
;; (define-key global-map "\C-ca" 'org-agenda)
;; (define-key global-map "\C-cc" 'org-capture)

;;capture todo items using C-c c t
(define-key global-map (kbd "C-c c") 'org-capture)
;; set key for agenda
    ;; (global-set-key (kbd "C-c a") 'org-agenda)

;; When you want to change the level of an org item, use SMR
(define-key org-mode-map (kbd "C-c C-g C-r") 'org-shiftmetaright)

;; Hide the markers so you just see bold text as BOLD-TEXT and not *BOLD-TEXT*
(setq org-hide-emphasis-markers t)

;; Wrap the lines in org mode so that things are easier to read
(add-hook 'org-mode-hook 'visual-line-mode)

(setq org-capture-templates
    '(    

      ("g" "General Tasks"
       entry (file+headline "~/PIM/tasks.org" "General Tasks")
       "* TODO [#B] %?\n:Created: %T\n "
       :empty-lines 0)

      ("c" "Code Task"
       entry (file+headline "~/PIM/tasks.org" "Code Tasks")
       "* TODO [#B] %?\n:Created: %T\n%i\n%a\nProposed Solution: "
       :empty-lines 0)

      ("l" "Work Log"
       entry (file+datetree "~/PIM/work-log.org")
       "* %?"
       :empty-lines 0)

      ("n" "Note"
       entry (file+headline "~/PIM/notes.org" "Random Notes")
       "** %?"
       :empty-lines 0)

      ("m" "Meeting"
       entry (file+daoetree "~/PIM/meetings.org")
       "* %? :meeting:%^g \n:Created: %T\n** Attendees\n*** \n** Notes
       \n** Action Items\n*** TODO [#A] "
       :tree-type week
       :clock-in t
       :clock-resume t
       :empty-lines 0)

      )
    )

;; TODO states
(setq org-todo-keywords
    '((sequence "TODO(t)" "PLANNING(p)" "IN-PROGRESS(i@/!)" "VERIFYING(v!)"
                "BLOCKED(b@)"  "|" "DONE(d!)" "OBE(o@!)" "WONT-DO(w@/!)" )
      ))

;; TODO colors
(setq org-todo-keyword-faces
  '(
    ("TODO" . (:foreground "GoldenRod" :weight bold))
    ("PLANNING" . (:foreground "DeepPink" :weight bold))
    ("IN-PROGRESS" . (:foreground "Cyan" :weight bold))
    ("VERIFYING" . (:foreground "DarkOrange" :weight bold))
    ("BLOCKED" . (:foreground "Red" :weight bold))
    ("DONE" . (:foreground "LimeGreen" :weight bold))
    ("OBE" . (:foreground "LimeGreen" :weight bold))
    ("WONT-DO" . (:foreground "LimeGreen" :weight bold))
    ))


;; Tags
(setq org-tag-alist '(
                    ;; Ticket types
                    (:startgroup . nil)
                    ("@bug" . ?b)
                    ("@feature" . ?u)
                    ("@spike" . ?j)                      
                    (:endgroup . nil)

                    ;; Ticket flags
                    ("@write_future_ticket" . ?w)
                    ("@emergency" . ?e)
                    ("@research" . ?r)

                    ;; Meeting types
                    (:startgroup . nil)
                    ("big_sprint_review" . ?i)
                    ("cents_sprint_retro" . ?n)
                    ("dsu" . ?d)
                    ("grooming" . ?g)
                    ("sprint_retro" . ?s)
                    (:endgroup . nil)

                    ;; Code TODOs tags
                    ("QA" . ?q)
                    ("backend" . ?k)
                    ("broken_code" . ?c)
                    ("frontend" . ?f)

                    ;; Special tags
                    ("CRITICAL" . ?x)
                    ("obstacle" . ?o)

                    ;; Meeting tags
                    ("HR" . ?h)
                    ("general" . ?l)
                    ("meeting" . ?m)
                    ("misc" . ?z)
                    ("planning" . ?p)

                    ;; Work Log Tags
                    ("accomplishment" . ?a)
                    ))

;; Tag colors
(setq org-tag-faces
    '(
      ("planning"  . (:foreground "mediumPurple1" :weight bold))
      ("backend"   . (:foreground "royalblue1"    :weight bold))
      ("frontend"  . (:foreground "forest green"  :weight bold))
      ("QA"        . (:foreground "sienna"        :weight bold))
      ("meeting"   . (:foreground "yellow1"       :weight bold))
      ("CRITICAL"  . (:foreground "red1"          :weight bold))
      )
    )

(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "ETBembo" :weight 'regular :height 200))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

 (efs/org-font-setup)
