emacs/.emacs.d/emacs.org
** Basic Config

This section contains the basic configuration for =org-mode= plus the configuration for Org agendas and capture templates.  There's a lot to unpack in here so I'd recommend watching the videos for [[https://youtu.be/VcgjTEa0kU4][Part 5]] and [[https://youtu.be/PNE-mgkZ6HM][Part 6]] for a full explanation.

#+begin_src emacs-lisp

  ;; (defun efs/org-mode-setup ()
  ;;   (org-indent-mode)
  ;;   (variable-pitch-mode 1)
  ;;   (visual-line-mode 1)
  ;;   (org-modern-mode))

  ;; (use-package org
  ;;   :hook (org-mode . efs/org-mode-setup)
  ;;   :config)
  ;;   (setq org-ellipsis " ▾")
  ;;   (setq org-agenda-start-with-log-mode t)
  ;;   (setq org-log-done 'time)
  ;;   (setq org-log-into-drawer t)

  ;;   (setq org-directory "~/PIM")
  ;;   (setq org-agenda-files
  ;;         '("~/PIM/tasks.org"
  ;;           "~/PIM/habits.org"
  ;;           "~/PIM/birthdays.org"))


  ;;   (require 'org-habit)
  ;;   (add-to-list 'org-modules 'org-habit)
  ;;   (setq org-habit-graph-column 60)

  ;;   (setq org-todo-keywords
  ;;     '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
  ;;       (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

  ;;   (setq org-refile-targets
  ;;     '(("Archive.org" :maxlevel . 1)
  ;;       ("tasks.org" :maxlevel . 1)))

  ;;   ;; Save Org buffers after refiling!
  ;;   (advice-add 'org-refile :after 'org-save-all-org-buffers)

  ;;   (setq org-tag-alist
  ;;     '((:startgroup)
  ;;        ; Put mutually exclusive tags here
  ;;        (:endgroup)
  ;;        ("@errand" . ?E)
  ;;        ("@home" . ?H)
  ;;        ("@work" . ?W)
  ;;        ("agenda" . ?a)
  ;;        ("planning" . ?p)
  ;;        ("publish" . ?P)
  ;;        ("batch" . ?b)
  ;;        ("note" . ?n)
  ;;        ("idea" . ?i)))

  ;;   ;; Configure custom agenda views
  ;;   (setq org-agenda-custom-commands
  ;;    '(("d" "Dashboard"
  ;;      ((agenda "" ((org-deadline-warning-days 7)))
  ;;       (todo "NEXT"
  ;;         ((org-agenda-overriding-header "Next Tasks")))
  ;;       (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

  ;;     ("n" "Next Tasks"
  ;;      ((todo "NEXT"
  ;;         ((org-agenda-overriding-header "Next Tasks")))))

  ;;     ("W" "Work Tasks" tags-todo "+work-email")

  ;;     ;; Low-effort next actions
  ;;     ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
  ;;      ((org-agenda-overriding-header "Low Effort Tasks")
  ;;       (org-agenda-max-todos 20)
  ;;       (org-agenda-files org-agenda-files)))

  ;;     ("w" "Workflow Status"
  ;;      ((todo "WAIT"
  ;;             ((org-agenda-overriding-header "Waiting on External")
  ;;              (org-agenda-files org-agenda-files)))
  ;;       (todo "REVIEW"
  ;;             ((org-agenda-overriding-header "In Review")
  ;;              (org-agenda-files org-agenda-files)))
  ;;       (todo "PLAN"
  ;;             ((org-agenda-overriding-header "In Planning")
  ;;              (org-agenda-todo-list-sublevels nil)
  ;;              (org-agenda-files org-agenda-files)))
  ;;       (todo "BACKLOG"
  ;;             ((org-agenda-overriding-header "Project Backlog")
  ;;              (org-agenda-todo-list-sublevels nil)
  ;;              (org-agenda-files org-agenda-files)))
  ;;       (todo "READY"
  ;;             ((org-agenda-overriding-header "Ready for Work")
  ;;              (org-agenda-files org-agenda-files)))
  ;;       (todo "ACTIVE"
  ;;             ((org-agenda-overriding-header "Active Projects")
  ;;              (org-agenda-files org-agenda-files)))
  ;;       (todo "COMPLETED"
  ;;             ((org-agenda-overriding-header "Completed Projects")
  ;;              (org-agenda-files org-agenda-files)))
  ;;       (todo "CANC"
  ;;             ((org-agenda-overriding-header "Cancelled Projects")
  ;;              (org-agenda-files org-agenda-files)))))))


  ;;   (setq org-capture-templates
  ;;     `(("t" "Tasks / Projects")
  ;;       ("tt" "Task" entry (file+olp "~/PIM/tasks.org" "Inbox")
  ;;            "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

  ;;       ("j" "Journal Entries")
  ;;       ("jj" "Journal" entry
  ;;            (file+olp+datetree "~/PIM/journal.org")
  ;;            "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
  ;;            ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
  ;;            :clock-in :clock-resume
  ;;            :empty-lines 1)
  ;;       ("jm" "Meeting" entry
  ;;            (file+olp+datetree "~/PIM/journal.org")
  ;;            "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
  ;;            :clock-in :clock-resume
  ;;            :empty-lines 1)

  ;;       ("w" "Workflows")
  ;;       ("we" "Checking Email" entry (file+olp+datetree "~/PIM/journal")
  ;;            "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

  ;;       ("m" "Metrics Capture")
  ;;       ("mw" "Weight" table-line (file+headline "~/PIM/Metrics.org" "Weight")
  ;;        "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

  ;;   ;; (define-key global-map (kbd "C-c j")
  ;;   ;;   (lambda () (interactive) (org-capture nil "t")))

  ;;   ;;capture todo items using C-c c t
  ;;   (define-key global-map (kbd "C-c c") 'org-capture)
  ;;   ;; set key for agenda
  ;;   (global-set-key (kbd "C-c a") 'org-agenda)

  ;;   (efs/org-font-setup)

#+end_src

** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src emacs-lisp

  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))

#+end_src

** Configure Babel Languages

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp

  (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes)

#+end_src

** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =<el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].

#+begin_src emacs-lisp

  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))

#+end_src

** Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =efs/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.


#+begin_src emacs-lisp

  (defun efs/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.emacs.d/emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

#+end_src

* Programming
** Languages
*** IDE Features with lsp-mode

