emacs/.emacs.d/init.el

;; (defun efs/org-mode-setup ()
;;   (org-indent-mode)
;;   (variable-pitch-mode 1)
;;   (visual-line-mode 1)
;;   (org-modern-mode))

;; (use-package org
;;   :hook (org-mode . efs/org-mode-setup)
;;   :config)
;;   (setq org-ellipsis " ▾")
;;   (setq org-agenda-start-with-log-mode t)
;;   (setq org-log-done 'time)
;;   (setq org-log-into-drawer t)

;;   (setq org-directory "~/PIM")
;;   (setq org-agenda-files
;;         '("~/PIM/tasks.org"
;;           "~/PIM/habits.org"
;;           "~/PIM/birthdays.org"))


;;   (require 'org-habit)
;;   (add-to-list 'org-modules 'org-habit)
;;   (setq org-habit-graph-column 60)

;;   (setq org-todo-keywords
;;     '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
;;       (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

;;   (setq org-refile-targets
;;     '(("Archive.org" :maxlevel . 1)
;;       ("tasks.org" :maxlevel . 1)))

;;   ;; Save Org buffers after refiling!
;;   (advice-add 'org-refile :after 'org-save-all-org-buffers)

;;   (setq org-tag-alist
;;     '((:startgroup)
;;        ; Put mutually exclusive tags here
;;        (:endgroup)
;;        ("@errand" . ?E)
;;        ("@home" . ?H)
;;        ("@work" . ?W)
;;        ("agenda" . ?a)
;;        ("planning" . ?p)
;;        ("publish" . ?P)
;;        ("batch" . ?b)
;;        ("note" . ?n)
;;        ("idea" . ?i)))

;;   ;; Configure custom agenda views
;;   (setq org-agenda-custom-commands
;;    '(("d" "Dashboard"
;;      ((agenda "" ((org-deadline-warning-days 7)))
;;       (todo "NEXT"
;;         ((org-agenda-overriding-header "Next Tasks")))
;;       (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

;;     ("n" "Next Tasks"
;;      ((todo "NEXT"
;;         ((org-agenda-overriding-header "Next Tasks")))))

;;     ("W" "Work Tasks" tags-todo "+work-email")

;;     ;; Low-effort next actions
;;     ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
;;      ((org-agenda-overriding-header "Low Effort Tasks")
;;       (org-agenda-max-todos 20)
;;       (org-agenda-files org-agenda-files)))

;;     ("w" "Workflow Status"
;;      ((todo "WAIT"
;;             ((org-agenda-overriding-header "Waiting on External")
;;              (org-agenda-files org-agenda-files)))
;;       (todo "REVIEW"
;;             ((org-agenda-overriding-header "In Review")
;;              (org-agenda-files org-agenda-files)))
;;       (todo "PLAN"
;;             ((org-agenda-overriding-header "In Planning")
;;              (org-agenda-todo-list-sublevels nil)
;;              (org-agenda-files org-agenda-files)))
;;       (todo "BACKLOG"
;;             ((org-agenda-overriding-header "Project Backlog")
;;              (org-agenda-todo-list-sublevels nil)
;;              (org-agenda-files org-agenda-files)))
;;       (todo "READY"
;;             ((org-agenda-overriding-header "Ready for Work")
;;              (org-agenda-files org-agenda-files)))
;;       (todo "ACTIVE"
;;             ((org-agenda-overriding-header "Active Projects")
;;              (org-agenda-files org-agenda-files)))
;;       (todo "COMPLETED"
;;             ((org-agenda-overriding-header "Completed Projects")
;;              (org-agenda-files org-agenda-files)))
;;       (todo "CANC"
;;             ((org-agenda-overriding-header "Cancelled Projects")
;;              (org-agenda-files org-agenda-files)))))))


;;   (setq org-capture-templates
;;     `(("t" "Tasks / Projects")
;;       ("tt" "Task" entry (file+olp "~/PIM/tasks.org" "Inbox")
;;            "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

;;       ("j" "Journal Entries")
;;       ("jj" "Journal" entry
;;            (file+olp+datetree "~/PIM/journal.org")
;;            "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
;;            ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
;;            :clock-in :clock-resume
;;            :empty-lines 1)
;;       ("jm" "Meeting" entry
;;            (file+olp+datetree "~/PIM/journal.org")
;;            "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
;;            :clock-in :clock-resume
;;            :empty-lines 1)

;;       ("w" "Workflows")
;;       ("we" "Checking Email" entry (file+olp+datetree "~/PIM/journal")
;;            "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

;;       ("m" "Metrics Capture")
;;       ("mw" "Weight" table-line (file+headline "~/PIM/Metrics.org" "Weight")
;;        "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))

;;   ;; (define-key global-map (kbd "C-c j")
;;   ;;   (lambda () (interactive) (org-capture nil "t")))

;;   ;;capture todo items using C-c c t
;;   (define-key global-map (kbd "C-c c") 'org-capture)
;;   ;; set key for agenda
;;   (global-set-key (kbd "C-c a") 'org-agenda)

;;   (efs/org-font-setup)

(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))

(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (python . t)))

(push '("conf-unix" . conf-unix) org-src-lang-modes)

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))

(defun efs/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/emacs.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
